Revit 2027 API
RebarUpdateCurvesData.GetHostId Method
 Gets the id of the host structural for this rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetHostId()
Public Function GetHostId As ElementId
public:
ElementId^ GetHostId()
member GetHostId : unit -> ElementId
Return Value
ElementId
 Returns the id of the host structural for this rebar.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace